Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: If we did this in a vacuum, we would have to factor it ourselves.
ht: Si nou te fè sa nan yon bale, nou pwal gen pou dekonpoze an faktè l' nou menm.

source: We wouldn't just be able to test their choices.
ht: Nou pa jis pou kapab tès chwa yo.

source: Let's do that.
ht: An n fè sa.

source: So if we multiply this out, we have 3t times 3t is 9t squared.
ht: Se konsa, si nou miltipliye a, nou genyen 3t tan 3t se 9t au.

source: Then you 3t times b, so it's plus 3bt.
ht: Lè sa a ou 3t toujou b, se sak rive vre plus 3bt.

source: Plus 3at plus ab.
ht: Plis 3at plis se.

source: So this simplifies to 9t squared plus.
ht: Se konsa sa simplifies pou 9t au plis.

source: Now what are we adding? Let's see.
ht: Koulye a sa sont nou ajoute? ann gade.

source: It says 3 times, a plus b, t.
ht: Li di fwa, yon plis b, t.

source: So it'd be 3 times, a plus b, t.
ht: Se konsa, li ta fwa, yon plus b, t.

source: I just added these two terms and I factored out the t and the 3 plus ab.
ht: Mwen te jis ajouté tèm de sa yo ak mwen pris deyò a t Et 3 la plis se.

source: Well now we can do a little pattern matching, right?
ht: Men koulye a nou ka fè yon ti pa gen fòm asòti, droit?

source: We could say a plus b times 3 is equal to 12.
ht: Nou te kapab di yon plus b fwa 3 egal a 12.

source: So a plus b is equal to what? a plus b is equal to 12.
ht: Se konsa yon plus b ki egal a sa? b plus yon egal a 12.

source: This whole coefficient right here is a 12 up here.
ht: Sa a an antye koefisyan droit isit la se yon 12 la anwo.

source: So a plus b, it must be equal to 4.
ht: Se konsa yon plus b, li dwe egal a 4.

source: Because 4 times 3 is equal to 12. a plus b is equal to 4 and we have a times b is also equal to 4.
ht: Paske 3 4 fwa egal a 12. b plus yon egal a 4 Et nou gen yon fwa b tou egal a 4.

source: So the only number that I can think of when I add them I get 4, when I multiply them I get 4 is 2 and 2.
ht: Se konsa anpil sèl sa mwen ka panse de lè mwen ajoute yo mwen jwenn 4, lè mwen grennen timoun yo gen tan mwen rive 4 se 2 Et 2.

source: Both of these are 2.
ht: Tou le de sa sont 2.

source: So if I were to factor this completely I get 3t plus 2 squared, essentially.
ht: Si m' to pou dekonpoze an faktè sa nèt mwen gen 3t plis 2 au, esansyèlman.

source: Because both of these terms are the same thing, and that's choice A.
ht: Tou le de kondisyon sa yo se menm bagay la, Et sa se chwa A.

source: A faster way frankly, to do this might have just been to multiply this out and say, that's the same thing.
ht: Yon fason pi vit kare, fè sa pou nou te ka sèlman te pou eple kou a Et di: sa se menm bagay.

source: Anyway, next problem.
ht: De tout fason, pwochen pwoblèm.

source: What is the complete factorization of 32 minus 8z squared?
ht: Ki sa ki pou dekonpoze an a nèt sou tout pwen faktè de 32 8z au moins?

source: So let's think about this a little bit.
ht: Se konsa nou panse osijè de sa yon ti bit.

source: So the first thing that I like to do once again is to try to factor out any numbers that are just common to all of the terms.
ht: Se konsa, premye bagay ke mwen renmen pou yo fè yon fwa ankò se pou eseye dekonpoze an faktè soti tout moun ke yo sèlman komen pou tout moun tèm.

source: So let me do that.
ht: Se pou m' fè bagay konsa.

source: So 32 minus 8z squared.
ht: Se konsa 32 moins 8z au.

source: 8 goes into both of these, right?
ht: 8 se nan tou le de sa, dwat?

source: So let's factor out an 8.
ht: Se konsa an n facteur soti yon 8.

source: And actually, let's factor out a negative 8, and I'll show you why did that.
ht: Aktyèlman, an n facteur soti yon negatif 8, Et m ap montre nou poukisa sa a.

source: Because I like to put the z squared, I like that one to be positive.
ht: Paske mwen renmen mete au z a, mwen renmen sa a pou pozitif.

source: So let's factor out a negative 8.
ht: Se konsa an n facteur soti yon negatif 8.

source: And so you get a minus 8.
ht: Et, ou jwenn yon moins 8.

source: And you didn't have to do that.
ht: Et, ou pa t gen pou fè sa.

source: You could have just factored an 8.
ht: Ou te kapab fè jis pris yon 8.

source: What's 32 divided by minus 8?
ht: Nan ki sa wap 32 divize pa moins 8

source: That's minus 4.
ht: Sa se moins 4.

source: And then minus 8z squared divided by minus 8 is just plus z squared.
ht: Et puis moins 8z au divize pa moins 8 se sèlman plis au z.

source: And so we can rearrange this, so this becomes minus 8, times z squared minus 4.
ht: Se konsa, nou ka vire sa a, se konsa sa devient moins 8, fwa z au moins 4.

source: And now I'll review this because this is an Algebra 1 test, so maybe this isn't obvious to you.
ht: Et koulye a m' ap revize sa paske se yon 1 Aljèb tès sa, se konsa gen dwa sa se pat evidan pou ou.

source: But in general, if you see something like this, a plus b times a minus b-- and this might be a good exercise for you to multiply this out.
ht: Men an jeneral, si ou wè yon bagay tankou sa a, yon plus b fwa yon mwens b - Et sa ka yon ekzèsis bon pou ou eple kou an konesans sa a.

source: But this is equal to a squared minus b squared, because the middle terms cancel out.
ht: Men sa rive fè yon au moins b au, paske la tèm mwayen annuler.

source: And that's a good exercise for you to do.
ht: E se pou sa yon ekzèsis bon pou ou fè.

source: So this has that same property.
ht: Se konsa, sa ki byen menm sa.

source: This is a squared minus b squared.
ht: Sa se yon au moins b au.

source: This is a perfect square.
ht: Sa se yon kare.

source: So then this up here can be factored as minus 8 times-- this is a squared minus b squared.
ht: Se konsa lè sa a sa a kanpe isit la kapab être pris moins 8 jou- sa se yon au moins b au.

source: So if we could say a is z and b is 2.
ht: Si nou te kapab di yon se z Et b se 2.

source: Because then when we would have z squared minus 2 squared, which is 4.
ht: Paske lè sa a lè nou pwal gen z au moins 2 au, ki se 4.

source: So if a is z, so it's z plus 2 times z minus 2.
ht: Si se konsa yon se z, se konsa li a z plis z 2 fwa moins 2.

source: This is probably the most common thing you'll see in a lot of factoring examples.
ht: Sa se byen kapab pi bon bagay ou ap wè nan yon bann tcheke repons nan ekzanp yo.

source: You'll see something that has this pattern, a squared minus b squared, and you should easily be able to recognize it.
ht: Ou ap wè yon bagay ki gen modèle sa a, yon au moins b au, e ou ta dwe fasil kapab pou ka rekonèt li.

source: You should be able to prove it to yourself as well that this is the same thing as a plus b times a minus b.
ht: Ou ta dwe gen dwa pou bay prèv li pou ou menm jan byen sa sa se menm bagay tankou yon plus b fwa yon moins b.

source: Or in this case, z plus 2 times z minus 2.
ht: Ou, nan ka sa, z plis 2 fwa z moins 2.

source: And that is z minus 2.
ht: E se pou sa z moins 2.

source: So this is interesting.
ht: Poutèt sa enteresan.

source: So I don't see exactly what we wrote.
ht: Se konsa, mwen pa wè egzakteman sa nou a.

source: I have a minus 8, but we want a z plus 2 and z minus 2.
ht: Mwen gen yon moins 8, men, nou pa vle yon z plis 2 Et z moins 2.

source: But they don't have that.
ht: Men, yo pa konn sa.

source: But what they do have is this-- let me rewrite it.
ht: Men, sa yo fè, se sa ki fè m' réécrire li.

source: They don't have any of it, but maybe they have-- they want the minus to be multiplied by one of these other terms.
ht: Yo pa konn anyen nan li, men yo gen dwa gen-yo vle pou gen miltiye pa youn nan sa yo ki tèm mwens.

source: So what we could do is we could multiply the minus because multiplication is associative.
ht: Se konsa sa nou te kapab fè, se nou te kapab eple kou an mwens paske miltiplikasyon asosiyatif.

source: It doesn't matter what order you do it in.
ht: Pa p gen poblèm ki bay lòd ou fè l.

source: So we could rewrite this as 8 times z plus 2 times minus 1 times z minus 2.
ht: Se konsa nou te kapab réécrire sa a kòm z 8 fwa plis 2 fwa moins 1 fwa z moins 2.

source: And then this becomes 8 times z plus 2.
ht: Et puis sa devient z 8 fwa plis 2.

source: This isn't minus 1, this is times minus 1.
ht: Bagay sa a pa moins 1, se yon fwa moins 1.

source: Times what?
ht: Fwa sa?

source: Minus z plus 2.
ht: Moins z plis 2.

source: And now I think that choice is there. Right.
ht: E kounye a mwen panse ke se la. pa vre.

source: So we can rewrite this as 8 times 2 plus z-- I'm just rearranging it-- times 2 minus z.
ht: Se konsa nou ka réécrire sa a kòm 2 8 fwa plis z-se mwen menm sèlman réorganisation li-fwa 2 moins z.

source: And then that is choice B.
ht: Lè sa a, sa se chwa b

source: And so really, given the choices they gave us, it probably would have been faster to just factor out an 8 from the beginning and not a positive 8.
ht: Bay reyèlman, opsyon yo ban nou, li pwobableman ta ont été plus pou jis kèk faktè soti yon 8 nan kòmansman Et pa yon pozitif 8.

source: And you would have immediately gotten to 2 plus z times 2 minus z.
ht: E ou ta ont imedyatman an pou 2 plis z fwa 2 moins z.

source: Anyway, I'll see you in the next video.
ht: De tout fason, m ap wè ou nan videyo kap vini an.

source: In which quadrant is the point -7, 7 located?
ht: Nan kadran ki se pwen-7, 7 lokalize?

source: So let's just review what a quadrant is
ht: Se konsa nou jis kèk revi ki yon kadran se

source: A quadrant is each of the four sections of the coordinate plane. and when we talk about the sections we're talking about the sections as divided by the coordinate axis.
ht: Yon kadran se chak nan kat seksyon de coordonner avyon an. Lè nou pale de seksyon nap pale de seksyon menm jan divize pa aks coordonner la.

source: So this right here is the x-axis, and this up down axis is the y-axis, and you can see it divides the coordinate plane into four sections.
ht: Se konsa droit isit la se sa l' a, ansanm ak moute desann aks y a, Et, ou kapab wè l' divise coordonner avyon an antre nan kat seksyon.

source: We call each of these sections quadrants
ht: Nou rele chak nan quadrants seksyon sa yo

source: This one over here where both the x values and y values are positive we call the first quadrant, and we use the roman numeral 1.
ht: UN sa a isit la sou kote tou de la x valè Et valè y sont pozitif nou rele premye kadran a, e nou sèvi ak sitwayen women nimewotasyon 1.

source: Then if we move counterclockwise around the coordinate plane
ht: Lè sa a, si nou mouvman le repère avyon an

source: This quadrant, where the x values are negative and the y values are positive we call the second quadrant.
ht: Kadran sa a, kote ke valè x yo sont negatif Et valè y sont pozitif nou rele dezyèm kadran a.

source: We call this the second quadrant.
ht: Nou rele sistèm gouvènman sa a dezyèm kadran.

source: Then we go down here, where both the x values are negative and the y values are negative, we call this the third quadrant.
ht: Lè sa a, n' a desann isit la, kote tou de valè x sont negatif Et valè y sont negatif, nou rele sistèm gouvènman sa a twazyèm kadran.

source: Once again using roman numerals.
ht: Yon fwa ankò itilize Romen chiffres.

source: Then finally the quadrant where the x values are positive but the y values are negative, we call this the fourth quadrant.
ht: Lè sa a la fen a kadran kote valè x yo pozitif men valè y sont negatif, nou rele sistèm gouvènman sa a katriyèm kadran.

source: So let's see which quadrant the point -7, 7 is located.
ht: Se konsa ann gade kadran ki pwen-7, 7 ye.

source: So there's two ways to think about it, you could just say look: We have a negative x value, our x value is negative, so we're gonna move to the left, we're gonna be on this side.
ht: Se konsa, nanpwen de jan panse osijè de sa, ou te kapab senpleman di gade: nou gen yon négatif x valè sa, valè x nou negatif, se poutèt sa, nou pral pou yo avanse sou bò gòch, nou pral rete sou bò sa a.

source: We're going to be on this of the coordinate plane.
ht: Nou pral rete sou sa de coordonner avyon an.

source: So just by the fact that the x value is negative, we're gonna be in either the second or the third quadrant.
ht: Se konsa senpleman pa Lefèt ke valè x negatif, nou pral nan soit dezyèm lan ou a twazyèm kadran.

source: Now we know that the y value is positive, we know that the y value is positive.
ht: Koulye a nou konnen ke valè y a pozitif, nou konnen ke valè y a pozitif.

source: So if the x value is negative, and the y value is positive, we're gonna land some place right overe here in the second quadrant.
ht: Se konsa si valè x negatif, Et valè y a pozitif, nou pwal nan peyi gen kèk kote bon overe isit la nan dezyèm kadran a.

source: The other way to think about it is that you can literally just plot this point and see that it falls in the second quadrant, so let's do that.
ht: Lòt fason pou panse osijè de sa se pou ou kapab mo pou mo jis tracé pwen sa a wa wè ke li tonbe nan dezyèm kadran a, se konsa nou fè bagay konsa.

source: If x is negative 7, so it's negative 1.
ht: Si x negatif 7, se poutèt sa negatif 1.

source: Negative 2.
ht: Negatif 2.

source: Negative 3.
ht: Negatif 3.

source: Negative 4,
ht: Negatif 4,

source: Negative 5.
ht: Negatif 5.

source: Negative 6.
ht: Negatif 6.

source: Negative 7.
ht: Negatif 7.

source: Did I do that right?
ht: Te fè m' fè sa ki dwat?

source: One.
ht: Yonn.

source: Two.
ht: De.

source: Three.
ht: Twa.

source: Four.
ht: Kat.

source: Five.
ht: Senk.

source: Six.
ht: Sis.

source: Seven.
ht: Sèt.

source: So x is negative 7, and then we have to go up 7, because y is positive 7.
ht: Se konsa, x ki negatif 7. Lè sa a nou gen pou moute 7, paske y 7 pozitif.

source: So one. Two.
ht: Se konsa yonn.

source: So the point -7, 7 is right over here.
ht: Se konsa, la point te-7, 7 se droit sou isit la.

source: Clearly lies in the second quadrant.
ht: Clairement se nan dezyèm kadran a.

source: Find the sum of 15 plus -46 plus 29.
ht: Jwenn mouri 15 plis-46 plis 29.

source: So lets just think about the first part over here
ht: Pour vous jis panse osijè de pòsyon sou isit la

source: We have 15 plus -46, we will worry about +29 later on.
ht: Nou gen 15 plis-46, nou pral enkyete w pou kesyon +29 pi ta nan.

source: So lets do 15 plus -46.
ht: Se konsa permet èske 15 plis-46.

source: We will get a different color.
ht: Nou pral genyen yon koulè diferan.

source: We will do it orange.
ht: N' a fè l' Orange Village.

source: Plus -46.
ht: Plis-46.

source: So we draw a number line here.
ht: Se konsa nou trase yon liy nimewo isit la.

source: Just we can properly visualize what is going on.
ht: Sèlman nou kapab bien visualiser sa k ap fèt.

source: That's my number line.
ht: Sa se liy nimewo m.

source: We are starting 15.
ht: Nou ap kòmanse 15.

source: Let me put 0 over here and we're starting with 15.
ht: Kite m' mete 0 sou isit la epi nou ap konmanse ak 15.

source: 15 could be right over here.
ht: 15 te kapab gen rezon sou isit la.

source: So this is 15.
ht: Se poutèt sa se 15.

source: Let me draw a big fat arrow to signify this is 15 15 has an absolute value of 15.
ht: Kite m' fè yon gwo flèch byen gra pou vle di se sa rele 15 15 gen yon valè absoli de 15.

source: So the length of this arrow would be 15.
ht: Se konsa, ki valè distans flèch sa a ta 15.

source: Now, we are adding -46 to that 15, that is the same thing...
ht: Koulye a, nou ajout-46 pou ke 15, ki se menm bagay...

source: This is equaivalent to 15-46, which means we are going to move 46 spots to the left of 15.
ht: Se sa rele equaivalent pou 15-46, sa vle di nou pwal kò li 46 tach sou bò gòch de 15.

source: Negative sign or minus needs to be the left on the number line.
ht: Négatif siy ou mwens bezwen pou yo sou bò gòch li sou liy nimewo a.

source: So we are going to 46 to the left.
ht: Se konsa nou pwal 46 sou bò gòch.

source: So we are starting with 15 and we are going to move 46 to the left.
ht: Se konsa nou ap kòmanse ak 15 e nou pwal pou yo avanse 46 sou bò gòch.

source: The length of this arrow right here is going to be 46.
ht: Ki valè distans flèch sa a isit-a pwal gen 46 zan.

source: We are moving to the left.
ht: Nou ap bouje sou bò gòch.

source: This is the negative 46 we are adding to the 15.
ht: Sa se negatif 46 zan nou ajouter le 15.

source: We are going to end up at some point over here.
ht: Nou pwal fini pouse nan kèk pwen sou isit la.

source: That point is clearly 0.
ht: Sa pwen se yon moun fou 0.

source: We were 15 to the right.
ht: Nou te gen 15 a dwat.

source: Now we are goig to move 46 to the left.
ht: Koulye a nou se goig pou yo avanse 46 sou bò gòch.

source: So we are definitely going to be the left of 0.
ht: Se konsa nou san mank ap vin fè bò gòch de 0.

source: So it's definitely going to a negative number.
ht: Se poutèt sa san mank ap negatif anpil.

source: We can even think about the absolute value of that negative number.
ht: Nou kapab panse menm osijè de valè absoli negatif nimewo sa.

source: We can just visualize it.
ht: Nou kapab sèlman visualiser li.

source: This yellow arrow has the length of 15 and this orange arrow has the length of 46
ht: Sa a jòn flèch la longueur de 15 Et sa a orange flèch la longueur de 46

source: The blue arrow that I am going about to draw which is the sum of these two is going to be have this length, right over here.
ht: Ble flèch mwen pral Sur trase ki se sòm nan yo de pwal gen ki bagay sa a, droit sou isit la.

source: And just visually, how can we figure out the length of the blue part.
ht: Et, jis visuelle, ki ka nou evalye ki valè distans de pati ble a.

source: If we know the length of this orange part and we know the length of this yellow part.
ht: Si nou konnen ki valè distans de pati orange sa a ak nou konnen ki valè distans de pati jòn sa a.

source: Well, it's just going to be the difference.
ht: Men, li jis ap gen diferans.

source: It's just going to be the difference of these two.
ht: Li jis ap fè diferans nan yo de.

source: So the absolute value of the sum is going to be the difference between this length 46 and 15.
ht: Se konsa valè absoli sòm sa a se pwal gen diferans ant sa a longueur 46 Et 15.

source: So this is 46...
ht: Se poutèt sa se 46...

source: Let me just figure it out.
ht: Kite m. Se pou jis evalye li.

source: 6 - 5 is 1, 4 - 1 is 3.
ht: 6 - 5, ki se 1, 4-1 se 3.

source: The length of this is going to be 31. and it's going to be 31 to the left of 0.
ht: La durée de sa a pwal gen 31. e li pwal être 31 sou bò gòch de 0.

source: This is going to be -31, right over here.
ht: Pran kè, être-31, droit sou isit la.

source: So we know the first part over here is -31 and then to that we are going to add 29.
ht: Se poutèt sa, nou konnen ki pòsyon sou isit la-31, apre yo pou sa nou pwal ajoute 29.

source: Let me do that another color.
ht: Pou m' fè sa, yon lòt koulè.

source: So what does that mean.
ht: Se konsa ki fè sa l vle di.

source: That means we start at -31.
ht: Sa vle di nou kòmanse nan-31.

source: So we are gonna move 29 to the right.
ht: Se konsa nou pwal deplase 29 pou dwa.

source: We are adding 29.
ht: Nou sont ajout 29.

source: So we are gonna to move 29 to the right.
ht: Se konsa nou pwal pou yo avanse 29 bò dwat.

source: Maybe that is right about there.
ht: Gen dwa konsa sou a.

source: The arrow of length 29.
ht: De longueur, 29 flèch.

source: I can draw a cleaner looking arrow than that.
ht: Mwen kapab trase yon netayaj ap chache flèch pase sa.

source: I'll do it right over here actually.
ht: M ap fè l dwat sou isit la aktyèlman.

source: So then we are going to 29 over to the right.
ht: Se konsa lè sa nou pwal 29 bò dwat.

source: That's the 29 part.
ht: Sa se pati nan 29.

source: So now this is the positive 29.
ht: Se poutèt sa se le 29 pozitif.

source: So how do we figure out what this is.
ht: Se konsa ki fè nou evalye sa se.

source: So this is going to land us...
ht: Se poutèt sa ap terrain nou...

source: So this number, ...
ht: Se poutèt sa a anpil,...

source: This is 29 right here that we are adding.
ht: Sa se 29 isit-menm pou nou ajoute.

source: This is going to land us right over here on the number line
ht: Sa ap terrain nou droit sou isit la sou liy nimewo a

source: So how do we figure out that number that is?
ht: Se konsa ki fè nou evalye nimewo sa ki se?

source: Well, once again we can just visualize it and eventually you want to draw a number line and the stuffs.
ht: Men, yon fwa ankò nou kapab sèlman visualiser li Et evantyèlman ou vle trase yon liy nimewo Et les aliments.

source: I think it'll be useful here.
ht: Mwen panse ke li pwal kapab itil isit la.

source: The number we are going to do.
ht: Le nimewo nou pwal fè.

source: We are starting from -31 and adding 29 to it.
ht: Nou ap kòmanse nan-31 Et ajouter 29 pou li.

source: Since we are adding a number less than -31, we are not going to get all the way back to 0.
ht: Depi nou sont pandan l ajoute yon foul moun, mwens ke-31, nou pa pwal jwenn tout chemen tounen 0.

source: So we are stilil going to have a negative number
ht: Se konsa nou se stilll pwal genyen yon nimewo negatif

source: But how to figure out the absolute value of that negative number, it's distance.
ht: Men kijan pou evalye valè absoli negatif nimewo sa, li a distans.

source: Once again, the little white part right there, that white part plus this 29 is going to equal to 31.
ht: Yon fwa ankò, a ti blan pati dwat la, pati blan sa plis 29 sa a va pou rive nan menm pou 31.

source: If we just think of the absolute value.
ht: Si nou jis panse de valè absoli a.

source: If we don't think about the signs, we just think about the length.
ht: Si nou pa panse osijè de mirak yo, nou jis panse osijè de la durée.

source: Or another way to think about is, 31-29 will give us the length of the white part and of course it's going to be negative.
ht: Ou yon lòt wout pou panse apwopo yo se 31-29, l' ap ban nou kantite a pati blan Et natirèlman li pwal être negatif.

source: Because the negative number here is larger than the positive number.
ht: Paske a negatif nombre isit la pi gwo tou pase anpil pozitif.

source: We are adding the two.
ht: Nou sont ajout de la.

source: So, 31-29, you can borrow and all of that.
ht: Se konsa, 31-29, ou kapab prete ak tou de sa.

source: But it's clearly just going to equal to 2.
ht: Men sa clairement jis ap rive fè 2.

source: You could say, that's 11, this is 2.
ht: Nou te kapab di: sa se 11, se sa rele 2.

source: Subtract.
ht: Retire.

source: This is equal to 2.
ht: Sa egal a 2.

source: Since it is -31 plus 29, it's going to be a negative 2.
ht: Depi se-31 plis 29, li pwal gen yon negatif 2.

source: We are still going to stay negative.
ht: Nou toujou pwal rete negatif.

source: We haven't moved far to the right enough to pass 0.
ht: Nou pa deplase byen lwen bò dwat ase pou yo pase 0.

source: This right here is going to be negative 2.
ht: Isit-menm kè en negatif 2.

source: Or another way to think about is that the length of the white bar, the absolute value is going to be 2.
ht: Ou yon lòt wout pou panse apwopo yo se sa durée de la kafe blan, valè absoli a pwal 2.

source: 2 + 29 is 31.
ht: 2 plis pase 29 se 31.

source: We are operating to left to 0.
ht: Nou ap opere bò gòch pou 0.

source: So it's negative 31.
ht: Se poutèt sa, se 31 negatif.

source: This is -2.
ht: Sa se-2.

source: Anyway, hopefully you found that useful.
ht: De tout fason, ak lespwa ke ou jwenn ki bon.

source: Oh anyway, I would like to make it clear.
ht: O de tout fason, mwen ta renmen pou fè wè.

source: So our final answer is negative 2.
ht: Se konsa nou reponn dènye se negatif 2.

source: I've talked a lot about the importance of hemoglobin in our red blood cells so I thought I would dedicate an entire video to hemoglobin.
ht: Mwen te pale anpil enpòtans ki genyen moglobin nan nou selil wouj se konsa mwen te panse ta consacrer yon tout antye videyo pou moglobin.
